<?php

$string['pluginname'] = 'Имэйджирэйтор';
$string['settings'] = 'Настройки генератора иллюстраций';

$string['server_url'] = 'Server URL';
$string['server_url_desc'] = 'Адрес сервера, на котором происходит генерация картинок';

$string['width'] = 'Ширина';
$string['width_desc'] = 'Ширина генерируемой картинки в пикселях. 512-1024.
При значениях не из диапазона может существенно ухудшиться качество или возрасти время генерации.';

$string['height'] = 'Высота';
$string['height_desc'] = 'Высота генерируемой картинки в пикселях. 512-1024.
При значениях не из диапазона может существенно ухудшиться качество или возрасти время генерации.';

$string['steps'] = 'Шаги';
$string['steps_desc'] = 'Число шагов. 1-4.
При значениях не из диапазона может существенно ухудшиться качество или возрасти время генерации.';